In [2]:
import pandas as panda

print(panda.__version__)

usersData = {
    "name": ["mano", "uma", "krishna", "vasantha"],
    "age": [20, 21, 22, 23],
    "gender": ["male", "female", "male", "male"],
    "salary": [10000, 20000, 30000, 40000],
    "city": ["bangalore", "chennai", "covai", "trichy"]
}

dataFrame_userData = panda.DataFrame(usersData)
dataFrame_userData.index = ["alpha", "beta", "gamma", "delta"]


filter_age = dataFrame_userData["age"] > 22
sorted_age = dataFrame_userData.sort_values(by="age", ascending=False)

grouping = sorted_age.groupby("gender").agg({"salary": "sum", "age": "mean"})

grouping_pivot = dataFrame_userData.pivot_table(index="name", values="salary", aggfunc="sum")

print(usersData, "\n", dataFrame_userData)

print("filter Data set")
print(dataFrame_userData[filter_age])

print("\n sorted Data set")
print(sorted_age)

print("\n grouping Data set")
print(grouping)

print("\n grouping Pivot table")
print(grouping_pivot)

print("\n grouping Data set")
print(grouping)
grouping_pivot

2.3.3
{'name': ['mano', 'uma', 'krishna', 'vasantha'], 'age': [20, 21, 22, 23], 'gender': ['male', 'female', 'male', 'male'], 'salary': [10000, 20000, 30000, 40000], 'city': ['bangalore', 'chennai', 'covai', 'trichy']}
            name  age  gender  salary       city
alpha      mano   20    male   10000  bangalore
beta        uma   21  female   20000    chennai
gamma   krishna   22    male   30000      covai
delta  vasantha   23    male   40000     trichy
filter Data set
           name  age gender  salary    city
delta  vasantha   23   male   40000  trichy

 sorted Data set
           name  age  gender  salary       city
delta  vasantha   23    male   40000     trichy
gamma   krishna   22    male   30000      covai
beta        uma   21  female   20000    chennai
alpha      mano   20    male   10000  bangalore

 grouping Data set
        salary        age
gender
female   20000  21.000000
male     80000  21.666667

 grouping Pivot table
          salary
name
krishna    30000
mano       10000
uma        20000
vasantha   40000

 grouping Data set
        salary        age
gender
female   20000  21.000000
male     80000  21.666667

          salary
name
krishna    30000
mano       10000
uma        20000
vasantha   40000

In [3]:
titanicDataSet = panda.read_csv("Titanic-Dataset.csv")

titanicDataSet

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# find duplicates in the dataset row by row
titanicDataSet.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [ ]:
# find duplicates in the dataset whole
titanicDataSet.duplicated().sum()

np.int64(0)

In [8]:
# find data types for each rows
titanicDataSet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB